[
  {
    "start": 540,
    "end": 570,
    "text": "We all know that ChatGPT can solve problems, generate content and even help you code. But did you know that you can also use ChatGPT to make an app? Yes! So in this video, I will show you a step-by-step process on how you can create an app using ChatGPT. Usually when you create an app, you need to have good knowledge in coding and app development. But in this video, we're going to use ChatGPT to generate the code and create a basic app like this. So make sure you watch this video till the end, because I will also show you how you can convert it into an APK file, which you can install on your Android device, share with your friends, or also publish it on the Play Store. I'm Bryan from Website Learners and let's get started. To make an app using ChatGPT, we're going to do 4 steps. First, decide what kind of app that you want to create. Now if you have an idea for an app, you can tell ChatGPT about it and how it should work. But for the purposes of this video, we're going to make a small game app like Tic Tac Toe. Let's go to ChatGPT and ask it to give me a HTML, CSS and a JavaScript code for a 2 player Tic Tac Toe game. You can see we have got the code. Now to check if the code is working correctly, let's use a tool called CodePen. So let's go to CodePen and click start coding. Here you can see we have 3 different sections, where you have to enter the HTML, CSS and the JavaScript code respectively. So let's go back to ChatGPT, then copy the HTML code and paste it here. Then do the same for the CSS and the JavaScript code. Once you have pasted the code, if we move this up, you can see we have a preview of our game. So let's test it out. As you can see, the game is working completely fine, but there are a few things that we can do to make it better. So first off, let's improve how it looks. So let's change the background color, add a popup to reveal who the winner is and also add a button here to restart the game. So let's go back to ChatGPT and ask it to regenerate the code with the changes we want. So let's copy the new HTML code, then go back to CodePen and replace the old code with the new one. Then do the same for the CSS and the JavaScript code and you can see that the background color has been changed. Now when we play the game, you can see it shows who has won the game in a popup and it has a button to start a new game and it has a button to restart the game. Now, if you want to add anything additional to your game and make changes, you can ask ChatGPT to get the code and replace them. Okay, so now that we have got the code from ChatGPT and tested it, we can now go to the next step, which is to save our code to the computer. First, we need to copy all this code in the notepad. So let's open a notepad, then copy this HTML code and paste it here. To save the file, let's create a new folder and name it, then save the file as index.html because only then our app will work properly. In the same way, let's open a new file, then copy the CSS code and paste it here. Then save this file as mentioned here, which is style.css. Again, let's open a new file, copy this javascript code and paste it here. Then save it as script.js. Okay, once you're done, we can run the game locally. So just go to the folder we created and if we open this index file, you can see that the game runs locally on our browser. So now we have successfully saved the code to our computer and now the app is working fine. As I told you earlier, I will show you a way to convert this app into a mobile app that you can install on your android device, share with your friends, or also publish it on the play store. So to convert this app into a mobile app, first we need to upload the app online. So to do that, we're going to use a tool called tiny.host. So just click the link below this video and it'll take you to this website. Now give a name for your app. I'm going to enter tic-tac-toe app and this will be the URL of your game. Next, we need to upload our app as a zip file. To do that, let's compress the files which we have saved on our computer. So let's right click on it, then go to send to and click compressed. Once it is done, just drag and drop your zip file here. Now click on google, then log into your google account and our app is now live. Now if we click on view site, you can see our app is live on the internet where we can share it with everyone. Okay, now we have successfully hosted our app online. Once it is done, we can now go to the final step, which is to convert the web app into a mobile app. So to convert it, we're going to use a tool called webin2 app. This tool is completely free to use, so just click the link below this video and it'll take you to this website. Now click on get started and here we need to enter the URL of our app. So to get that, let's go to our app, copy this URL, go back and paste it here. Then enter a name for our app and click next. Now here we need to add an icon for our app. So let's click on set icon, then select the icon, click open, then the icon will be added here. Now if you don't have any icon for your app, you can check out this site called flat icon and you can get an icon from here. Okay, once you've added the app icon, click on make app, then enter these details, click on register and again click on make app. As you can see, we have converted our web app into a mobile app. So once it is done, we can go ahead and download our app. So just click here, click download, then click download all files and the app will be downloaded to your computer. Now we are almost there, so let's download this tic-tac-toe app into our phone. To do that, we need to extract the zip file on our computer. So let's open the file which we just downloaded, then right click on it, click on extract all and click extract. Now if you open that folder, then open the android folder, you can see we have the apk file here. So once you have got the apk file, we can go ahead and install the app on our android phone. So let's open a new tab, then click here and go to google drive. Now drag and drop the apk file here and it will be uploaded to the drive. So once it is uploaded, let's download and install the apk file on our phone. So go to google drive, open the apk file, click install and click open. As you can see, our app has been installed on our phone and in the same way, you can make any app in just a few minutes. Okay, so that's it guys. This is how you can make an app using chat gpt. I have given you all the links that you need in the description below. And if you are interested in creating more advanced games with chat gpt, like this one, then make sure you watch this video. And if you like this video, give it a thumbs up and leave a comment below. Also, subscribe to website learners and hit that bell icon for more videos like this one. Thanks for watching guys. I'll see you in the next video. Until then, take care, bye-bye."
  }
]